Tekla Open API Reference for Tekla Structures 2025
MaterialItem Methods
The MaterialItem type exposes the following members.
Methods
Name | Description
Delete
 Delete this material from material database.
Export
 Exports the material item in the material database to given file name. Materials are exported to *.lis format. If path is not given material is exported to model folder. If filename is empty material name is used as filename.
Insert
 Inserts this material item to material database.
MaterialNameMaxLength
 Returns the maximum length a material name can be.
Modify
 Modifies the material in material database that has the same name as this instance.
Select()
 Selects the material item from the database based on the material name and alias name in this instance.
Select(String)
 Selects the material item based on the name from the material database. The material name can also be an alias name.
Top
See Also
Reference
MaterialItem Class
Tekla.Structures.Catalogs Namespace